Revit 2027 API
GroupLoadOptions.ReplaceDuplicatedGroups Property
 If there are groups with the same names in source and destination documents set this property to true to replace existing groups, otherwise the operation will be canceled. The default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ReplaceDuplicatedGroups { get; set; }
Public Property ReplaceDuplicatedGroups As Boolean
	Get
	Set
public:
property bool ReplaceDuplicatedGroups {
	bool get ();
	void set (bool value);
}
member ReplaceDuplicatedGroups : bool with get, set
Property Value
Boolean
See Also
Reference
GroupLoadOptions Class
Autodesk.Revit.DB Namespace